# IsTileGroupContainedObject

## Description
Determines if the specified object is a tile group-contained object.

```pascal
FUNCTION IsTileGroupContainedObject(objectHandle : HANDLE): BOOLEAN;
```

```python
def vs.IsTileGroupContainedObject(objectHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The object handle to check.|

## Examples
```pascal
return := IsTileGroupContainedObject(objectHandle);
```

## See Also
VS Functions:
CreateTile
| ShowEditTileDialog
| ShowEditTileSettingsDialog
| ShowNewTileDialog
| GetTileGeometryGroup
| BeginGroupN
| AddTileGeometryObject
| GetTileGroupParent
| IsTileGroupContainedObject
| GetTileBackgroundColor
| SetTileBackgroundColor
| GetTileRepetitionPoint
| SetTileRepetitionPoint
| GetTileOffsetPoint
| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011

## Category
* Document Attributes